nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Protocol_808.h
/*
     Protocol 808 .h
*/
#ifndef  _PROTOCOL808
#define   _PROTOCOL808

#include <rthw.h>
#include <rtthread.h>
#include "stm32f4xx.h"
#include "usart.h"
#include "board.h"
#include <serial.h>
#include "App_moduleConfig.h" 
#include "gps.h"

#define  BD_ENABLE



 // ----   Media  Trans state ---
#define   MEDIA
#define  enable                1
#define  disable               0
#define  other                  2
#define  transfer             3 



//------------  GPS function------
#define  INIT         1
#define  PROCESS      0

#define  K_adjust_Duration       20                //  校验K值所需要时间  


// -------  ISP  Address   -------------
#define    ISP_APP_Addr                        0x6400    //  512*50  Page
#define    ISP_RAM_Addr                       0x1400   // 512*10 Page
 

//------- 通话状态---------
#define CallState_Idle 		        0 
#define CallState_Ring 		        1
#define CallState_Connected	        2
#define CallState_Hangup		    4
#define CallState_rdytoDialLis      5
#define CallState_Dialing           8   //主叫拨号


//-----------------行车记录仪  附录A 命令字 --------------------
// 1. 上载命令字 
#define  A_Up_DrvInfo          0x01        //  当前驾驶人信息
#define  A_Up_RTC              0x02        //  采集记录仪的实时时钟
#define  A_Up_Dist             0x03        //  采集里程
#define  A_Up_PLUS             0x04        //  采集记录仪特征系数
#define  A_Up_AvrgMin          0x05        //  每分钟平均速度记录
#define  A_Up_VechInfo         0x06        //  车辆信息
#define  A_Up_Doubt            0x07        //  事故疑点数据
#define  A_Up_N2daysDist       0x08        //  采集最近2个日历天的累计行驶里程
#define  A_Up_N2daysSpd        0x09        //  采集最近2个日历天内的行驶速度数据 
#define  A_Up_Tired            0x11        //  疲劳驾驶记录   

// 2. 下传命令 
#define  A_Dn_DrvInfo          0x81        //  设置驾驶员信息
#define  A_Dn_VehicleInfo      0x82        //  设置车辆信息
#define  A_Dn_RTC              0xC2        //  设置记录仪时间
#define  A_Dn_Plus             0xC3        //  设置速度脉冲系数

// 3.  传输方式
#define   Trans_Serial         0           //  串口方式传输
#define   Trans_WireLess       1           //  无线传输


// 4. 808 协议   消息ID
#define   MSG_0x0001           0x0001      // 终端通用应答
#define   MSG_0x8001           0x8001      // 平台通用应答
#define   MSG_0x0002           0x0002      // 终端心跳 
#define   MSG_0x0100           0x0100      // 终端注册
#define   MSG_0x8100           0x8100      // 终端注册应答
#define   MSG_0x0101           0x0101      // 终端注销
#define   MSG_0x0102           0x0102      // 终端鉴权
#define   MSG_0x8103           0x8103      // 设置终端参数 
#define   MSG_0x8104           0x8104      // 查询终端参数
#define   MSG_0x0104           0x0104      // 查询终端参数应答
#define   MSG_0x0107           0x0107      //  BD --终端属性查询
#define   MSG_0x0108           0x0108      //  BD--终端升级结果通知
#define   MSG_0x0704           0x0704      //  BD--定位数据批量上传
#define   MSG_0x0705           0x0705      //  BD-- CAN 总线数据上传
#define   MSG_0x0805           0x0805      //  BD-- 摄像头立即拍摄命令应答
#define   MSG_0x8105           0x8105      // 终端控制
#define   MSG_0x0200           0x0200      // 位置信息汇报 
#define   MSG_0x8201           0x8201      // 位置信息查询
#define   MSG_0x0201           0x0201      // 位置信息查询应答 
#define   MSG_0x8202           0x8202      // 临时位置跟踪控制
#define   MSG_0x8300           0x8300      // 文本信息下发
#define   MSG_0x8301           0x8301      // ---事件设置
#define   MSG_0x0301           0x0301      // ---事件报告
#define   MSG_0x8302           0x8302      // ---提问下发
#define   MSG_0x0302           0x0302      // ---提问应答
#define   MSG_0x8303           0x8303      // ---信息点播菜单设置
#define   MSG_0x0303           0x0303      // ---信息点播 取消
#define   MSG_0x8304           0x8304      // ---信息服务
#define   MSG_0x8400           0x8400      // ---电话回拨
#define   MSG_0x8401           0x8401      // ---设置电话本
#define   MSG_0x8500           0x8500      // 车辆控制
#define   MSG_0x0500           0x0500      // 车俩控制应答
#define   MSG_0x8600           0x8600      // 设置圆形区域
#define   MSG_0x8601           0x8601      // 删除圆形区域
#define   MSG_0x8602           0x8602      // 设置矩形区域
#define   MSG_0x8603           0x8603      // 删除矩形区域
#define   MSG_0x8604           0x8604      // 设置多边形区域
#define   MSG_0x8605           0x8605      // 删除多边形区域
#define   MSG_0x8606           0x8606      // 设置路线
#define   MSG_0x8607           0x8607      // 删除路线
#define   MSG_0x8700           0x8700      // 行车记录仪数据采集命令
#define   MSG_0x0700           0x0700      // 行驶记录仪数据上传
#define   MSG_0x8701           0x8701      // 行驶记录仪但是下传
#define   MSG_0x0701           0x0701      // ---电子运单上报
#define   MSG_0x0702           0x0702      // 驾驶员身份信息采集上报
#define   MSG_0x0800           0x0800      // ---多媒体事件信息上传
#define   MSG_0x0801           0x0801      // ---多媒体数据上传
#define   MSG_0x8800           0x8800      // ---多媒体数据上传应答
#define   MSG_0x8801           0x8801      // 摄像头立即拍照命令
#define   MSG_0x8802           0x8802      // 存储多媒体数据检索
#define   MSG_0x0802           0x0802      // 存储多媒体数据检索应答
#define   MSG_0x8803           0x8803      // 存储多媒体数据上传
#define   MSG_0x8804           0x8804      // 录音开始命令 
#define   MSG_0x8900           0x8900      // 数据下行透传
#define   MSG_0x0900           0x0900      // 数据上行透传
#define   MSG_0x0901           0x0901      // 数据压缩上报
#define   MSG_0x8A00           0x8A00      // 平台RSA公钥
#define   MSG_0x0A00           0x0A00      // 终端RSA公钥

//--------  发送包的方式  ------
#define   Packet_Normal         0        //  正常包     
#define   Packet_Divide         1        //  分包

#define   SpxBuf_Size       512
#define   SpxGet_Size       100


//---------  ISP 	相关   ---
#define  ISPACK_92             0x92
#define  ISPinfoACK_94         0x94
#define  ISPoverACK_96         0x96

typedef struct _A_AckFlag 
{
	// 1. 上载命令字 
u8  A_Flag__Up_Ver_00H             ;// 0x00   1     //  记录仪执行标准版本号
u8  A_Flag_Up_DrvInfo_01H          ;// 0x01   2     //  当前驾驶人信息
u8  A_Flag_Up_RTC_02H              ;// 0x02   3     //  采集记录仪的实时时钟
u8  A_Flag_Up_Dist_03H             ;//0x03    4    //  采集里程
u8  A_Flag_Up_PLUS_04H             ;//0x04    5    //  采集记录仪速度脉冲系数
u8  A_Flag_Up_VechInfo_06H         ;//0x06    6    //  车辆信息
u8  A_Flag_Up_SetInfo_08H          ;//0x08    7    //  状态配置信息
u8  A_Flag_Up_DevID_16H            ;//0x16    8    //  记录仪唯一ID
u8  A_Flag_Up_AvrgSec_09H          ;//0x09    9    //  每秒钟平均速度记录
u8  A_Flag_Up_AvrgMin_05H          ;//0x05    10    //  每分钟平均速度记录
u8  A_Flag_Up_Posit_13H            ;//0x13    11    //  指定位置信息记录
u8  A_Flag_Up_Doubt_07H            ;//0x07    12    //  事故疑点数据
u8  A_Flag_Up_Tired_11H            ;//0x11    13    //  疲劳驾驶记录
u8  A_Flag_Up_LogIn_10H            ;//0x10    14    //  登入登出记录
u8  A_Flag_Up_Powercut_14H         ;//0x14    15    //  外部供电记录
u8  A_Flag_Up_SetMdfy_15H          ;//0x15    16    //  参数修改记录
	
