nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Protocol_808.h
//-------------------- Media_SD_State 
typedef struct
{
  u8  SD_flag;        // 图片数据发送标志
  u8  photo_sending; //  处于照片发送状态
  u16 SD_packetNum;  //  发送数据的包序号
  u16 Total_packetNum; // 拍照的总包数
  u8  Data_SD_counter; //  数据发送间隔    
  u16  Exeption_timer;   //  异常情况下定时器
  
}_Media_SD_state;


typedef union TIPAddr
{
	u8				ip8[4];	// access the ip as either 4 seperate bytes
	u32				ip32;	// ... or as a single 32-bit dword
} T_IP_Addr;


typedef struct  _GNSS_RAW
{
    u8  WorkEnable;// 使能传输GNSS 原始信息
    u8  first_record;// 首次接收处理
    u8  rd_num;    //读取
    u8  wr_num;    //写入
    u8  save_status;//  bit 0-3     1:表示有数据 0: 表示没有新数据
    u16  Raw_wr;//
    u8    Raw[4][800];//数据存储buffer

}GNSS_RAW;

//------- 北斗扩展协议  ------------
extern GNSS_RAW     GNSS_rawdata; //  GNSS 详细数据上报
extern BD_EXTEND     BD_EXT;     //  北斗扩展协议
extern DETACH_PKG   Detach_PKG; // 分包重传相关
extern SET_QRY         Setting_Qry; //  终端参数查询
extern PRODUCT_ATTRIBUTE   ProductAttribute;// 终端属性
extern HUMAN_CONFIRM_WARN   HumanConfirmWarn;// 人工确认报警

//===============================================================================================
extern _Media_SD_state Photo_sdState;   //  图片发送状态
extern _Media_SD_state Sound_sdState;	//声音发送  
extern _Media_SD_state Video_sdState;	//视频发送
//------ Photo -----
extern  u32 PicFileSize; // 图片文件大小  
extern  u8  PictureName[40];       



//------  voice -----



//------  video  --------



//-------  行车记录仪相关extern BD_EXTEND     BD_EXT;     //  北斗扩展协议

extern Avrg_MintSpeed  Avrgspd_Mint; 
extern u32         PerMinSpdTotal; //记录每分钟速度总数  
extern u8          avgspd_Mint_Wr;       // 填写每分钟平均速度记录下标
extern u8          avgspd_Sec_Wr;       // 填写每秒钟平均速度记录下标
extern u8          avgWriteOver;   // 写溢出标志位
extern u8          AspdCounter;    // 每分钟速度有效报数计数器 
extern  u8         Vehicle_sensor; // 车辆传感器状态   0.2s  查询一次  
extern  u8		   Vehicle_sensor_BAK; // 车辆传感器状态	0.2s  查询一次	

extern  DOUBT_TYPE        Sensor_buf[100];// 20s 状态记录   
extern 	u8		   save_sensorCounter,sensor_writeOverFlag;  
extern u16  Delta_1s_Plus;
extern 	u32 	   total_plus; 



extern u8		 fCentre_ACK; 			  // ---------判断中西你应答标志位－－
extern u8		 ACK_timer;				   //---------	ACK timer 定时器--------------------- 
extern u8        f_ISP_ACK;   // 远程升级应答	
extern u8        ISP_FCS[2];    //  下发的校验 
extern u16       ISP_total_packnum;  // ISP  总包数
extern u16       ISP_current_packnum;// ISP  当前包数
extern u32       ISP_content_fcs;    // ISP  的内容校验
extern u8		 ISP_ack_resualt;    // ISP 响应
extern u8		 ISP_rxCMD;		   // ISP 收到的命令
extern u8		 f_ISP_88_ACK;	   // Isp  内容应答
extern u8        ISP_running_state;  // Isp  程序运行状态
extern u8        f_ISP_23_ACK;    //  Isp  返回 文件完成标识
extern u16       ISP_running_counter;// Isp  运行状态寄存器 
extern u8        ISP_RepeatCounter; //   ISP 单包发送重复次数 超过5次校验失败擦除区域 
extern u8        ISP_NeedtoProcessFlag;   //   需要处理ISP 程序
extern u8        ISP_Raw[600];                    //  属于ISP 但还未处理的字符 

extern ISP_RSD   Isp_Resend;

extern u8 TextInforCounter;//文本信息条数
extern DOORCamera   DoorOpen;    //  开关车门拍照
extern MEDIA_INDEX  MediaIndex;  // 多媒体信息
extern INOUT        InOut_Object;  // 进出围栏状态 
extern DATATRANS    DataTrans;     // 数据信息透传
extern MULTIMEDIA   MediaObj;      // 多媒体信息 
extern VOICE_RECODE VoiceRec_Obj;   //  录音功能  
extern CAMERA       Camera_Obj;     //  中心拍照相关
extern RECODER      Recode_Obj;     // 行车记录仪
extern POINT        POINT_Obj;      // 路线的拐点
extern ROUTE        ROUTE_Obj;      // 路线相关
extern POLYGEN_RAIL Rail_Polygen;   // 多边形围栏
extern RECT_RAIL    Rail_Rectangle; // 矩形围栏
extern CIRCLE_RAIL  Rail_Cycle;  // 圆形围栏
extern VEHICLE_CONTROL Vech_Control; //  车辆控制
extern PHONE_BOOK    PhoneBook;  //  电话本
extern PHONE_BOOK	 PhoneBook_8[20];
extern MSG_BRODCAST  MSG_BroadCast_Obj;    // 信息点播  
extern MSG_BRODCAST   MSG_Obj_8[8];  // 信息点播  
extern CENTRE_ASK     ASK_Centre;  // 中心提问
extern EVENT          EventObj;    // 事件
extern EVENT          EventObj_8[8]; // 事件  
//-------文本信息-------
extern MSG_TEXT       TEXT_Obj;
extern MSG_TEXT       TEXT_Obj_8[8],TEXT_Obj_8bak[8];

extern TEXT_INFO      TextInfo;    // 文本信息下发

extern SPD_EXP    speed_Exd;      // 超速报警
extern DevRegst   DEV_regist;  // 注册
extern DevLOGIN   DEV_Login;   //  鉴权


extern NANDSVFlag   NandsaveFlg;
extern A_AckFlag    Adata_ACKflag;
extern TCP_ACKFlag  SD_ACKflag;  

extern u8 tts_bro_tired_flag;

extern u8           SubCMD_8103H;            //  02 H命令 设置记录仪安装参数回复 子命令 
extern u32         SubCMD_FF01H;            //  FF02 北斗信息扩展
extern u32         SubCMD_FF03H;     //  FF03  设置扩展终端参数设置1

extern u8          SubCMD_10H;            //  10H   设置记录仪定位告警参数
extern u8	       OutGPS_Flag; // 0  默认  1  接外部有源天线
extern u8	       Spd_senor_Null;  // 手动传感器速度为0
extern u32         Centre_DoubtRead;     //  中心读取事故疑点数据的读字段
extern u32         Centre_DoubtTotal;    //  中心读取事故疑点的总字段  


extern u8 		   FCS_GPS_UDP;						//UDP 数据异或和
extern u8          FCS_RX_UDP;                       // UDP 数据接收校验 
extern u8          Centre_IP_modify;            //  中修改IP了 
extern u8          IP_change_counter;           //   中心修改IP 计数器
extern u8		   Down_Elec_Flag;				 //   断油断电使能标志位 


extern ALIGN(RT_ALIGN_SIZE) u8          GPRS_info[900]; 
extern u16         GPRS_infoWr_Tx;


//------ phone
extern u8       CallState; // 通话状态


extern  GPRMC_PRO GPRMC_Funs;


//--------  GPS prototcol------------------------------------------------------------------------------------------------
extern u8   UDP_dataPacket_flag;			   /*V	   0X03 	 ;		   A	  0X02*/
extern u8   DispContent;   // 发送时是否显示数据内容  
extern u8  Camera_Number;



extern u8	GPS_getfirst; 		 //  首次有经纬度 
extern u8	HDOP_value;		 //  Hdop 数值	  
extern u8   Satelite_num;   // 卫星颗数

extern u8   CurrentTime[3];
extern u8   BakTime[3];
extern u8   Sdgps_Time[3];  // GPS 发送 时间记录  


extern  ALIGN(RT_ALIGN_SIZE) u8  UDP_HEX_Rx[1024];    // EM310 接收内容hex     
extern u16 UDP_hexRx_len;    // hex 内容 长度
extern u16 UDP_DecodeHex_Len;// UDP接收后808 解码后的数据长度   



extern GPS_RMC  GPRMC;                   // GPMC格式  
//---------- 808 协议 -----------------------------------------------------------------------------------------------
extern 	u16 	        GPS_Hight;			   //	808协议-> 高程	 m 
extern  u16		        Speed_gps;    // 通过GPS计算出来的速度 km/h   
extern 	u16	            GPS_speed;								  //  GPS定位时候的速度 km/h
extern  u16			    GPS_direction;							  //  GPS方向		 单位2度        

//---------- 用GPS校准特征系数相关 ----------------------------
extern u8		Speed_area; // 校验K值范围
extern u16		Speed_cacu; // 通过K值计算出来的速度 
extern u16 	    Spd_adjust_counter; // 确保匀速状态计数器 
extern u16      Former_DeltaPlus[K_adjust_Duration]; // 前几秒的脉冲数 
extern u8       Former_gpsSpd[K_adjust_Duration];// 前几秒的速度        
extern u8		DF_K_adjustState; // 特征系数自动校准状态说明
extern u8       Jia_GPS_spdFlag;  //  假gps spd Flag   
extern u16     Speed_gps_jiashi;   //  假时GPS 真速度


