nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Protocol_808.h
 //------- 车辆负载状态 ---------------
extern u8      CarLoadState_Flag;//选中车辆状态的标志   1:空车   2:半空   3:重车
 //------- 多媒体信息类型---------------
extern u8  Multimedia_Flag;//需要上传的多媒体信息类型	1:视频	 2:音频   3:图像
extern u8  SpxBuf[SpxBuf_Size];  
extern u16 Spx_Wr,Spx_Rd; 
extern u8	Duomeiti_sdFlag; 

//------- 录音开始或者结束---------------
extern u8  Recor_Flag; //  1:录音开始   2:录音结束  


// ---- 拐点 -----
extern u16  Inflexion_Current;      
extern u16  Inflexion_Bak;       
extern u16  Inflexion_chgcnter; //变化计数器
extern u16  InflexLarge_or_Small;	    // 判断curent 和 Bak 大小	0 equql  1 large  2 small
extern u16  InflexDelta_Accumulate;	//	差值累计 


// ----休眠状态  ------------
extern u8   SleepState;  //   0  不休眠ACC on        1  休眠Acc Off     
extern u8	SleepConfigFlag; //  休眠时发送鉴权标志位

//---- 固定文件大小 --- 
extern u32 mp3_fsize;   
extern u32 wmv_fsize;    
extern u8  mp3_sendstate;
extern u8  wmv_sendstate;



//---------- 河北天地通协议 ------------------------------------------------------------------------------------------	
extern  u8		SIM_code[6];							   // 要发送的IMSI	号码
extern  u8		IMSI_CODE[15];							//SIM 卡的IMSI 号码
extern  u8		Warn_Status[4]; // 报警状态信息
extern  u8		Car_Status[4];  // 车辆状态信息   
extern T_GPS_Info_GPRS 	 Gps_Gprs;	 
extern T_GPS_Info_GPRS	 Temp_Gps_Gprs;
extern u8	    A_time[6]; // 定位时刻的时间  
// 定位时刻的时间
extern u8       ReadPhotoPageTotal;
extern u8       SendPHPacketFlag; ////收到中心启动接收下一个block时置位

//-------- 紧急报警 --------
extern u8		warn_flag;		  
extern u8		f_Exigent_warning;//0;     //脚动 紧急报警装置 (INT0 PD0)
extern u8		Send_warn_times;     //   设备向中心上报报警次数，最大3 次
extern u32  	    fTimer3s_warncount;


extern POSIT Posit[60];                //  每分钟位置信息存储
extern u8    PosSaveFlag;             //  存储Pos 状态位

extern u8   Vehicle_RunStatus;    //  bit 0: ACC 开 关             1 开  0关
                                  //  bit 1: 通过速度传感器感知    1 表示行驶  0 表示停止   
                                  //  bit 2: 通过gps速度感知       1 表示行驶  0 表示停止  
extern u8   Status_TiredwhRst;    //  当复位时 疲劳驾驶的状态   0 :停车  1:停车但没触发 2:触发了还没结束                              


extern u8    SpxSrcName[13];
extern u32   SrcFileSize,DestFilesize,SrcFile_read; 
extern u8	 SleepCounter;  

extern u16   DebugSpd;	//调试用GPS速度      
extern u8	 MMedia2_Flag;
extern u8     Send_Rdy4ok;

//---------74CH595  Q5   control Power----
extern u8   Print_power_Q5_enable;     
extern u8   Buzzer_on_Q7_enable; 

//==================================================================================================
// 第一部分 :   以下是GPS 解析转换相关函数 
//==================================================================================================

extern void Time_pro(u8 *tmpinfo, u8 hour, u8 min , u8 sec);
extern void Status_pro(u8 *tmpinfo);
extern void Latitude_pro(u8 *tmpinfo);
extern void Lat_NS_pro(u8 *tmpinfo);
extern void Longitude_pro(u8 *tmpinfo);
extern void Long_WE_pro(u8 *tmpinfo);
extern void Speed_pro(u8 *tmpinfo,u8 Invalue,u8 Point);
extern void Direction_pro(u8 *tmpinfo,u8 Invalue,u8 Point);
extern void Date_pro(u8 *tmpinfo,u8 fDateModify, u8 hour, u8 min , u8 sec); 
extern void HDop_pro(u8 *tmpinfo); 
extern void   GPS_Delta_DurPro(void);    //告GPS 触发上报处理函数 

//==================================================================================================
// 第二部分 :   以下是外部传感器状态监测
//==================================================================================================
/*    
     -----------------------------
     2.1   和协议相关的功能函数
     ----------------------------- 
*/
extern void IMSI_Convert_SIMCODE( void );
extern u8 ISP_running_Status(void);
extern int IP_Str(char *buf, u32 IP);
extern void strtrim(u8 *s, u8 c);
extern int str2ip(char *buf, u8 *ip);
/*    
     -----------------------------
     2.2 输入管脚状态监测
     ----------------------------- 
*/

/*    
     -----------------------------
    2.3  控制输出
     ----------------------------- 
*/
extern void  Enable_Relay(void);
extern void  Disable_Relay(void);


/*    
     -----------------------------
    2.4  不同协议状态寄存器变化
     ----------------------------- 
*/

extern void StatusReg_WARN_Enable(void);
extern void StatusReg_WARN_Clear(void);
extern void StatusReg_ACC_ON(void);
extern void StatusReg_ACC_OFF(void);
extern void StatusReg_POWER_CUT(void);
extern void StatusReg_POWER_NORMAL(void);
extern void StatusReg_GPS_A(void);
extern void StatusReg_GPS_V(void);
extern void StatusReg_SPD_WARN(void);
extern void StatusReg_SPD_NORMAL(void);
extern void StatusReg_Relay_Cut(void);
extern void StatusReg_Relay_Normal(void);
extern void StatusReg_Default(void);  
extern void GNSS_RawDataTrans_Init(u8 mode);  // 北斗添加


	





//==================================================================================================
// 第三部分 :   以下是GPRS无线传输相关协议
//==================================================================================================

extern  u8  Do_SendGPSReport_GPRS(void);   
extern void  Save_GPS(void);    
extern u8    Stuff_DevCommmonACK_0001H(void);        
extern u8    Stuff_RegisterPacket_0100H(u8  LinkNum);  
extern u8    Stuff_DeviceDeregister_0101H(void);      
extern u8    Stuff_DeviceHeartPacket_0002H(void);
extern u8    Stuff_DevLogin_0102H(void);      
extern u8    Stuff_Normal_Data_0200H(void); 
extern u8    Stuff_Current_Data_0200H(void);   //  发送即时数据不存储到存储器中 
extern u8    Stuff_Current_Data_0201H(void);   //   位置信息查询回应
extern u8    Stuff_SettingPram_0104H(u8 in);
extern u8    Stuff_EventACK_0301H(void);   
extern u8    Stuff_ASKACK_0302H(void);    
extern u8	 Stuff_MSGACK_0303H(void);	  
extern u8    Stuff_ControlACK_0500H(void);    //   车辆控制应答
extern u8    Stuff_RecoderACK_0700H(void);   //   行车记录仪数据上传
extern u8    Stuff_MultiMedia_InfoSD_0800H(void);      
extern u8    Stuff_MultiMedia_Data_0801H(void);    
extern u8    Stuff_MultiMedia_IndexAck_0802H(void);  
extern u8    Stuff_DataTransTx_0900H(void);     
extern u8    Stuff_DriverInfoSD_0702H(void);  
extern u8    Stuff_Worklist_0701H(void); 
extern u8    Stuff_DeviceAttribute_BD_0107H(void);
extern u8    Stuff_GNSSRawData_0900H(u8*Instr , u16  len);          

extern u8    Stuff_DataTrans_0900_ISP_ACK(u8  AckType);  
extern u8    Update_HardSoft_Version_Judge(u8 * instr);
extern void  ISP_file_Check(void);
extern void  ISP_Process(void);  


extern void delay_us(u16 j);
extern void delay_ms(u16 j);


