nathanlnw/705_tw_ceritfy/bsp/stm32f407vgt6_RecDrv/app_712/protocol_808/Protocol_808.h
#if 0
extern void  Stuff_ISP_ack(void);      // ISP  
extern void  Stuff_ISPinfo_ack(void);      // ISP  
#endif

extern  void  Media_Start_Init( u8  MdType , u8  MdCodeType);
extern  void  Media_Clear_State(void);
extern  void  Media_Timer(void); 
extern  void  Media_RSdMode_Timer(void);
extern  void  Media_Timer_Service(void); 
extern  void  Meida_Trans_Exception(void);
extern  void  TTS_play(u8 * instr);

extern void   Photo_send_start(u16 Numpic);  
extern  void  DataTrans_Init(void);
extern void  TIRED_Drive_Init(void);
extern u8     Sound_send_start(void);

extern void  TCP_RX_Process(u8  LinkNum);  
extern u16    AsciiToGb(u8 *dec,u8 InstrLen,u8 *scr);
extern void  Time2BCD(u8 *dest);     



extern void SpeedWarnJudge(void);
extern void Process_GPRSIN_DeviceData(u8 *instr, u16  infolen);
extern u8   Send_Device_Data(void);


extern void  Sleep_Mode_ConfigEnter(void); 
extern void  Sleep_Mode_ConfigExit(void);

//extern u16   WaveFile_EncodeHeader(u32 inFilesize ,u8* DestStr);   
extern void  CycleRail_Judge(u8* LatiStr,u8* LongiStr);
extern void  RectangleRail_Judge(u8* LatiStr,u8* LongiStr);       
extern u8    Save_MediaIndex( u8 type, u8* name, u8 ID,u8 Evencode);  
//extern void  Sound_SaveStart(void);
//extern void  Sound_SaveEnd(void); 
extern void    DoorCameraInit(void);
extern void    MSG_BroadCast_Read(void); 
extern u8      Time_FastJudge(void);   
//extern u8  RecordSerial_output_Str(const char *fmt,...); 
extern void    Tired_Check(void);
extern void     OutPrint_HEX(u8 * Descrip, u8 *instr, u16 inlen );\
extern void     local_time(void);

extern void tiredon(void);
extern void tiredoff(void);
extern void gpsspd(u8 *strin);   //  GPS 用假速度 
extern void sensorspd(u8 *strin);   //  GPS 用假速度

//==================================================================================================
// 第四部分 :   808  相关存储处理  
//==================================================================================================

extern void  JT808_Related_Save_Process(void);
extern void  Save_Status(u8 year,u8 mon,u8 day,u8 hour,u8 min,u8 sec);
extern void  Spd_Exp_Wr(void);


//==================================================================================================
// 第五部分 :   以下是行车记录仪相关协议 即 附录A   
//==================================================================================================









#endif
